# ===============================================================
#                             Taps
# ===============================================================

tap 'homebrew/cask-fonts'
tap 'homebrew/core'
tap 'homebrew/services'
tap 'pivotal/tap'
tap 'cloudfoundry/tap'

# ===============================================================
#                           Binaries
# ===============================================================

brew 'coreutils'
brew 'dockutil'
brew 'nvim'
brew 'maven@3.5'
brew 'wget'
brew 'git-together'
brew 'node'
brew 'yarn'
brew 'yarn-completion'
brew 'mysql'
brew 'zsh-completion'
brew 'diff-so-fancy'
brew 'cf-cli'
brew 'direnv'


# ===============================================================
#                           MacOS Apps
# ===============================================================

cask 'adoptopenjdk8'
cask 'java8'
cask 'chromium'
cask 'google-chrome'
cask 'firefox'
cask 'iterm2'
cask 'vscodium'
cask 'intellij-idea'
cask 'slack'
cask 'hammerspoon'
cask 'rar'
cask 'kitty'

# ===============================================================
#                           MacOS Fonts
# ===============================================================

cask 'font-hasklug-nerd-font'
cask 'font-fira-code'
cask 'font-victor-mono'
